app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "St Mary"], ["room_number", 2], ["created_at", "2021-03-20 12:07:36.252628"], ["updated_at", "2021-03-20 12:07:36.252628"]]